Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD1G.svd
            <register>
               <dim>8</dim>
               <dimIncrement>2</dimIncrement>
               <name>PVR[%s]</name>
               <description>Preset Value Register 0 (for initialization)</description>
               <addressOffset>0x60</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>SDCLKFSEL</name>
                     <description>SDCLK Frequency Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CLKGSEL</name>
                     <description>Clock Generator Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SISR</name>
               <description>Slot Interrupt Status Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTSSL</name>
                     <description>Interrupt Signal for Each Slot</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCVR</name>
               <description>Host Controller Version Register</description>
               <addressOffset>0xFE</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SVER</name>
                     <description>Specification Version Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VVER</name>
                     <description>Vendor Version Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APSR</name>
               <description>Additional Present State Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>HDATLL</name>
                     <description>DAT[7:4] High Line Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC1R</name>
               <description>e.MMC Control 1 Register</description>
               <addressOffset>0x204</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>CMDTYP</name>
                     <description>e.MMC Command Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMDTYPSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>The command is not an e.MMC specific command.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAITIRQ</name>
                           <description>This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). Refer to 'Interrupt Mode' in the 'Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51' .</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STREAM</name>
                           <description>This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT</name>
                           <description>Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDR</name>
                     <description>e.MMC HSDDR Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPD</name>
                     <description>e.MMC Open Drain Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOTA</name>
                     <description>e.MMC Boot Acknowledge Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTN</name>
                     <description>e.MMC Reset Signal</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCD</name>
                     <description>e.MMC Force Card Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC2R</name>
               <description>e.MMC Control 2 Register</description>
               <addressOffset>0x205</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SRESP</name>
                     <description>e.MMC Abort Wait IRQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOOT</name>
                     <description>e.MMC Abort Boot</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>AHB Control Register</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BMAX</name>
                     <description>AHB Maximum Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BMAXSelect</name>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>The maximum burst size is INCR16.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>The maximum burst size is INCR8.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>The maximum burst size is INCR4.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Only SINGLE transfers are performed.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC2R</name>
               <description>Clock Control 2 Register</description>
               <addressOffset>0x20C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSDCLKD</name>
                     <description>Force SDCLK Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC1R</name>
               <description>Retuning Timer Control 1 Register</description>
               <addressOffset>0x210</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TMREN</name>
                     <description>Retuning Timer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TMRENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The retuning timer is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The retuning timer is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC2R</name>
               <description>Retuning Timer Control 2 Register</description>
               <addressOffset>0x211</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RLD</name>
                     <description>Retuning Timer Reload</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCVR</name>
               <description>Retuning Timer Counter Value Register</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCVAL</name>
                     <description>Retuning Timer Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISTER</name>
               <description>Retuning Timer Interrupt Status Enable Register</description>
               <addressOffset>0x218</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEVTSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The TEVT status flag in SDMMC_RTISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The TEVT status flag in SDMMC_RTISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISIER</name>
               <description>Retuning Timer Interrupt Signal Enable Register</description>
               <addressOffset>0x219</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEVTSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the TEVT status rises in SDMMC_RTISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the TEVT status rises in SDMMC_RTISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISTR</name>
               <description>Retuning Timer Interrupt Status Register</description>
               <addressOffset>0x21C</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTSSR</name>
               <description>Retuning Timer Status Slots Register</description>
               <addressOffset>0x21D</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEVTSLOT</name>
                     <description>Retuning Timer Event Slots</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUNCR</name>
               <description>Tuning Control Register</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMPLPT</name>
                     <description>Sampling Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CACR</name>
               <description>Capabilities Control Register</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CAPWREN</name>
                     <description>Capabilities Write Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALCR</name>
               <description>Calibration Control Register</description>
               <addressOffset>0x240</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>PADs Calibration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALWYSON</name>
                     <description>Calibration Analog Always ON</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUNDIS</name>
                     <description>Calibration During Tuning Disabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNTVAL</name>
                     <description>Calibration Counter Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CALN</name>
                     <description>Calibration N Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALP</name>
                     <description>Calibration P Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
