Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD1G.svd
            <register>
               <name>HSMC_PMECCFG</name>
               <description>PMECC Configuration Register</description>
               <addressOffset>0x070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCH_ERR</name>
                     <description>Error Correcting Capability</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BCH_ERRSelect</name>
                        <enumeratedValue>
                           <name>BCH_ERR2</name>
                           <description>2 errors</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR4</name>
                           <description>4 errors</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR8</name>
                           <description>8 errors</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR12</name>
                           <description>12 errors</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR24</name>
                           <description>24 errors</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR32</name>
                           <description>32 errors</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SECTORSZ</name>
                     <description>Sector Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SECTORSZSelect</name>
                        <enumeratedValue>
                           <name>SECTORSZ0</name>
                           <description>Use  512 Byte Sector in ECC Computation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECTORSZ1</name>
                           <description>Use 1024 Byte Sector in ECC Computation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PAGESIZE</name>
                     <description>Number of Sectors in the Page</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PAGESIZESelect</name>
                        <enumeratedValue>
                           <name>PAGESIZE_1SEC</name>
                           <description>1 sector for main area (512 or 1024 bytes)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_2SEC</name>
                           <description>2 sectors for main area (1024 or 2048 bytes)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_4SEC</name>
                           <description>4 sectors for main area (2048 or 4096 bytes)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_8SEC</name>
                           <description>8 sectors for main area (4096 or 8192 bytes)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NANDWR</name>
                     <description>NAND Write Access</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPAREEN</name>
                     <description>Spare Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTO</name>
                     <description>Automatic Mode Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSAREA</name>
               <description>PMECC Spare Area Size Register</description>
               <addressOffset>0x074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SPARESIZE</name>
                     <description>Spare Area Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSADDR</name>
               <description>PMECC Start Address Register</description>
               <addressOffset>0x078</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>STARTADDR</name>
                     <description>ECC Area Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCEADDR</name>
               <description>PMECC End Address Register</description>
               <addressOffset>0x07C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENDADDR</name>
                     <description>ECC Area End Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCTRL</name>
               <description>PMECC Control Register</description>
               <addressOffset>0x084</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RST</name>
                     <description>Reset the PMECC Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Start a Data Phase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>Start a User Mode Phase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>PMECC Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISABLE</name>
                     <description>PMECC Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSR</name>
               <description>PMECC Status Register</description>
               <addressOffset>0x088</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>The kernel of the PMECC is busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>PMECC Enable bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIER</name>
               <description>PMECC Interrupt Enable register</description>
               <addressOffset>0x08C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRIE</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIDR</name>
               <description>PMECC Interrupt Disable Register</description>
               <addressOffset>0x090</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRID</name>
                     <description>Error Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIMR</name>
               <description>PMECC Interrupt Mask Register</description>
               <addressOffset>0x094</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRIM</name>
                     <description>Error Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCISR</name>
               <description>PMECC Interrupt Status Register</description>
               <addressOffset>0x098</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRIS</name>
                     <description>Error Interrupt Status Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>64</dimIncrement>
               <name>SMC_PMECC[%s]</name>
               <description/>
               <addressOffset>0xB0</addressOffset>
               <register>
                  <dim>14</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>HSMC_PMECC[%s]</name>
                  <description>PMECC Redundancy 0 Register (sec_num = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>ECC</name>
                        <description>BCH Redundancy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>8</dim>
               <dimIncrement>64</dimIncrement>
               <name>SMC_REM[%s]</name>
               <description/>
               <addressOffset>0x2B0</addressOffset>
               <register>
                  <name>HSMC_REM0_</name>
                  <description>PMECC Remainder 0 Register (sec_num = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM1_</name>
                  <description>PMECC Remainder 1 Register (sec_num = 0)</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM2_</name>
                  <description>PMECC Remainder 2 Register (sec_num = 0)</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM3_</name>
                  <description>PMECC Remainder 3 Register (sec_num = 0)</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM4_</name>
                  <description>PMECC Remainder 4 Register (sec_num = 0)</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM5_</name>
                  <description>PMECC Remainder 5 Register (sec_num = 0)</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM6_</name>
                  <description>PMECC Remainder 6 Register (sec_num = 0)</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM7_</name>
                  <description>PMECC Remainder 7 Register (sec_num = 0)</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM8_</name>
                  <description>PMECC Remainder 8 Register (sec_num = 0)</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM9_</name>
                  <description>PMECC Remainder 9 Register (sec_num = 0)</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM10_</name>
                  <description>PMECC Remainder 10 Register (sec_num = 0)</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
