Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D27CLD1G.svd
               <register>
                  <name>EPTSETSTA</name>
                  <description>UDPHS Endpoint Set Status Register (endpoint = 0)</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>FRCESTALL</name>
                        <description>Stall Handshake Request Set</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>KILL Bank Set (for IN Endpoint)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY</name>
                        <description>TX Packet Ready Set</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTSETSTA_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Set Status Register (endpoint = 0)</description>
                  <alternateRegister>EPTSETSTA</alternateRegister>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>KILL Bank Set (for IN Endpoint)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY_TRER</name>
                        <description>TX Packet Ready Set</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCLRSTA</name>
                  <description>UDPHS Endpoint Clear Status Register (endpoint = 0)</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>FRCESTALL</name>
                        <description>Stall Handshake Request Clear</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TOGGLESQ</name>
                        <description>Data Toggle Clear</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Clear</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Clear</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RX_SETUP</name>
                        <description>Received SETUP Clear</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STALL_SNT</name>
                        <description>Stall Sent Clear</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_IN</name>
                        <description>NAKIN Clear</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_OUT</name>
                        <description>NAKOUT Clear</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTCLRSTA_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Clear Status Register (endpoint = 0)</description>
                  <alternateRegister>EPTCLRSTA</alternateRegister>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>TOGGLESQ</name>
                        <description>Data Toggle Clear</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data Clear</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete Clear</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FL_ISO</name>
                        <description>Error Flow Clear</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_CRC_NTR</name>
                        <description>Number of Transaction Error Clear</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FLUSH</name>
                        <description>Bank Flush Error Clear</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTSTA</name>
                  <description>UDPHS Endpoint Status Register (endpoint = 0)</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>FRCESTALL</name>
                        <description>Stall Handshake Request (cleared upon USB reset)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TOGGLESQ_STA</name>
                        <description>Toggle Sequencing (cleared upon USB reset)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TOGGLESQ_STASelect</name>
                           <enumeratedValue>
                              <name>DATA0</name>
                              <description>DATA0</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA1</name>
                              <description>DATA1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA2</name>
                              <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MDATA</name>
                              <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error (cleared upon USB reset)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data/KILL Bank (cleared upon USB reset)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete (cleared upon USB reset)</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY</name>
                        <description>TX Packet Ready (cleared upon USB reset)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RX_SETUP</name>
                        <description>Received SETUP (cleared upon USB reset)</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STALL_SNT</name>
                        <description>Stall Sent (cleared upon USB reset)</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_IN</name>
                        <description>NAK IN (cleared upon USB reset)</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAK_OUT</name>
                        <description>NAK OUT (cleared upon USB reset)</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CURBK_CTLDIR</name>
                        <description>Current Bank/Control Direction (cleared upon USB reset)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>BUSY_BANK_STA</name>
                        <description>Busy Bank Number (cleared upon USB reset)</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BUSY_BANK_STASelect</name>
                           <enumeratedValue>
                              <name>_0BUSYBANK</name>
                              <description>All banks are free</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_1BUSYBANK</name>
                              <description>1 busy bank</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_2BUSYBANKS</name>
                              <description>2 busy banks</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_3BUSYBANKS</name>
                              <description>3 busy banks</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BYTE_COUNT</name>
                        <description>UDPHS Byte Count (cleared upon USB reset)</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet (cleared upon USB reset)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPTSTA_ISOENDPT_MODE</name>
                  <description>UDPHS Endpoint Status Register (endpoint = 0)</description>
                  <alternateRegister>EPTSTA</alternateRegister>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>TOGGLESQ_STA</name>
                        <description>Toggle Sequencing (cleared upon USB reset)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TOGGLESQ_STASelect</name>
                           <enumeratedValue>
                              <name>DATA0</name>
                              <description>DATA0</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA1</name>
                              <description>DATA1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA2</name>
                              <description>Data2 (only for High Bandwidth Isochronous Endpoint)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MDATA</name>
                              <description>MData (only for High Bandwidth Isochronous Endpoint)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ERR_OVFLW</name>
                        <description>Overflow Error (cleared upon USB reset)</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXRDY_TXKL</name>
                        <description>Received OUT Data/KILL Bank (cleared upon USB reset)</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TX_COMPLT</name>
                        <description>Transmitted IN Data Complete (cleared upon USB reset)</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXRDY_TRER</name>
                        <description>TX Packet Ready/Transaction Error (cleared upon USB reset)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FL_ISO</name>
                        <description>Error Flow (cleared upon USB reset)</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_CRC_NTR</name>
                        <description>CRC ISO Error/Number of Transaction Error (cleared upon USB reset)</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR_FLUSH</name>
                        <description>Bank Flush Error (cleared upon USB reset)</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CURBK</name>
                        <description>Current Bank (cleared upon USB reset)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CURBKSelect</name>
                           <enumeratedValue>
                              <name>BANK0</name>
                              <description>Bank 0 (or single bank)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BANK1</name>
                              <description>Bank 1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BANK2</name>
                              <description>Bank 2</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BUSY_BANK_STA</name>
                        <description>Busy Bank Number (cleared upon USB reset)</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BUSY_BANK_STASelect</name>
                           <enumeratedValue>
                              <name>_0BUSYBANK</name>
                              <description>All banks are free</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_1BUSYBANK</name>
                              <description>1 busy bank</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_2BUSYBANKS</name>
                              <description>2 busy banks</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_3BUSYBANKS</name>
                              <description>3 busy banks</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BYTE_COUNT</name>
                        <description>UDPHS Byte Count (cleared upon USB reset)</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>SHRT_PCKT</name>
                        <description>Short Packet (cleared upon USB reset)</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>7</dim>
               <dimIncrement>16</dimIncrement>
               <name>UDPHS_DMA[%s]</name>
               <description/>
               <addressOffset>0x300</addressOffset>
               <register>
                  <name>DMANXTDSC</name>
                  <description>UDPHS DMA Next Descriptor Address Register (channel = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NXT_DSC_ADD</name>
                        <description>Next Descriptor Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMAADDRESS</name>
                  <description>UDPHS DMA Channel Address Register (channel = 0)</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>BUFF_ADD</name>
                        <description>Buffer Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
